lib/xml/deleteAgentGroup.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:deleteAgentGroup>
            <!--Optional:-->
            <groupName>?</groupName>
        </ser:deleteAgentGroup>
    </soapenv:Body>
</soapenv:Envelope>